Revit 2026 API

# ExportLinetypeInfo(ExportLinetypeInfo) Constructor

---

Constructs a new copy of the input ExportLinetypeInfo object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportLinetypeInfo(
	ExportLinetypeInfo other
)
```
```vb
Public Sub New (
	other As ExportLinetypeInfo
)
```
```cpp
public:
ExportLinetypeInfo(
	ExportLinetypeInfo^ other
)
```
```fsharp
new :
        other : ExportLinetypeInfo -> ExportLinetypeInfo
```

#### Parameters

other ExportLinetypeInfo

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLinetypeInfo Class

ExportLinetypeInfo Overload

Autodesk.Revit.DB Namespace